<?php
// Modified: 06.03.2017
include "../../f_vars0.php";
?>

<title>Интернет-Ферма. Инструкция. С чего начать</title>
</head>
<?php
include "0_menuru.php";
?>
			<tr style='background:#f0ffff' height='40'>
				<td colspan='6'>
					<div style='margin-left:7; margin-right:7'><font size='+2'><b>С чего начать</b></font></div>
				</td>
			</tr>
			</table>
		</div></div>
		<div id='content' style='background:#f0ffff; height:60%; overflow-y:auto'><div style='margin-left:7; margin-right:7'>
<p></p>
			<div style='float:left; margin:7'><img border='0' src='files/101_00.jpg'></div>
<p>Перед началом работы с системой управления необходимо выполнить ряд обязательных предварительных операций:</p>
<b>1. Установка транспондеров</b><br>
			<div style='float:right; margin:7'><img border='0' src='files/101_01.jpg'></div>
<p>Для того, чтобы система могла идентифицировать животных, на них необходимо установить транспондеры. В зависимости от типа транспондера, его нужно установить или в ухо животного, или на ногу, или установить ошейник с ним.</p>
<b>2. Регистрация транспондеров</b><br>
<p>Есть два основных способа регистрации кодов транспондеров в программе:
			<div style='float:right; margin:7'><img border='0' src='files/101_02.jpg'></div>
<ul>
<li>регистрация с клавиатуры компьютера;</li>
<li>полуавтоматическая регистрация из доильного зала.</li>
</ul>
</p>
<p><b>Регистрация с клавиатуры компьютера</b></p>
<p>В этом случае в программе создаётся <a href='files/101_03ru.jpg' target='_blank'>электронная карточка животного</a> и в неё заносится номер животного в стаде и код установленного транспондера. В момент установки транспондеров на животных зоотехник должен зафиксировать на бумаге номер животного и код его транспондера.</p>
<p><b>Полуавтоматическая регистрация из доильного зала</b></p>
<p>В этом случае используется возможность программирования номера животного непосредственно с клавиатуры блока доения. Процедура состоит в том, что животные проходят через систему распознавания, которая считывает коды транспондеров, а на клавиатуре блоков доения вводятся номера животных. После этого в системе автоматически создаются карточки животных с введёнными номерами и распознаными кодами транспондеров.</p>
			<div style='float:right; margin:7'><img border='0' src='files/101_04.jpg'></div>
<b>3. Внесение данных животного</b><br>
<p>После регистрации необходимо внести паспортные данные животного в его карточку. Например: кличку, дату рождения, вес, измерения и т. д.</p>
<p>Дата рождения - это очень важный параметр, относительно которого программа автоматически считает возраст животного и его биологический календарь (номер лактации, сухостой и т. д.). Биологический календарь не может быть правильно рассчитан без внесения даты рождения животного.</p>
<p>В дальнейшем зоотехник продолжает вносить текущие изменения состояния животных в их карточки. Например: отёл, осеменение, фактическое выведение в сухостой и т. д.</p>
		</div></div>
		<div id='page-clear'></div>
	</div>
	<div id='footer'><div style='margin-left:0; margin-right:0'>
		<table align='center' border='0' cellpadding='0' cellspacing='0' height='100%' width='100%'>
		<tr background='files/menu.jpg'>
			<td></td>
		</tr>
		</table>
	</div></div>
</body>
</html>
