<?php
// Modified: 06.03.2017
include "../../f_vars0.php";
?>

<title>Інтернет-Ферма. Інструкція. З чого почати</title>
</head>
<?php
include "0_menuuk.php";
?>
			<tr style='background:#f0ffff' height='40'>
				<td colspan='6'>
					<div style='margin-left:7; margin-right:7'><font size='+2'><b>З чого почати</b></font></div>
				</td>
			</tr>
			</table>
		</div></div>
		<div id='content' style='background:#f0ffff; height:60%; overflow-y:auto'><div style='margin-left:7; margin-right:7'>
<p></p>
			<div style='float:left; margin:7'><img border='0' src='files/101_00.jpg'></div>
<p>Перед початком роботи з системою управління необхідно виконати ряд обов’язкових попередніх операцій:</p>
<b>1. Встановлення транспондерів</b><br>
			<div style='float:right; margin:7'><img border='0' src='files/101_01.jpg'></div>
<p>Для того, щоб система могла ідентифікувати тварин, на них необхідно встановити транспондери. В залежності від типу транспондера, він може бути встановлений або у вухо тварини, або прикріплений до ноги, або підвішений на шиї.</p>
<b>2. Реєстрація транспондерів</b><br>
<p>Існують два основних способи реєстрації кодів транспондерів у програмі:
			<div style='float:right; margin:7'><img border='0' src='files/101_02.jpg'></div>
<ul>
<li>реєстрація з клавіатури комп’ютера;</li>
<li>напівавтоматична реєстрація з доїльного залу.</li>
</ul>
</p>
<p><b>Реєстрація з клавіатури комп’ютера</b></p>
<p>В цьому випадку в програмі створюється <a href='files/101_03uk.jpg' target='_blank'>електронна картка тварини</a> і до неї заноситься номер тварини в стаді, а також код транспондера, який був на неї встановлений. В момент встановлення транспондерів на тварин зоотехнік має зафіксувати на папері номер тварини та код її транспондера.</p>
<p><b>Напівавтоматична реєстрація з доїльного залу</b></p>
<p>В цьому випадку використовується можливість програмування номера тварини безпосередньо з доїльного апарата. Процедура полягає в тому, що тварини проходять через систему розпізнавання, яка зчитує коди транспондерів, а на доїльних апаратах реєструються номери тварин. Після цього в системі автоматично створяться картки тварин із введеними номерами, до яких додадуться коди їх транспондерів.</p>
					<div style='float:right; margin:7'><img border='0' src='files/101_04.jpg'></div>
<b>3. Внесення даних тварини</b><br>
<p>Після реєстрації необхідно внести паспортні дані тварини до її картки. Наприклад: прізвисько, дату народження, вагу, виміри, т. і.</p>
<p>Дата народження є надзвичайно важливим параметром, відносно якого програма автоматично обраховує вік тварини і її поточний біологічний стан (номер лактації, стан охоти, сухостій, т. і.). Біологічний календар тварини без введення дати народження не обраховується.</p>
<p>В подальшому зоотехнік продовжує вносити поточні зміни стану тварин до їх карток. Наприклад: отел, запліднення, виведення в сухостій, т. і.</p>
		</div></div>
		<div id='page-clear'></div>
	</div>
	<div id='footer'><div style='margin-left:0; margin-right:0'>
		<table align='center' border='0' cellpadding='0' cellspacing='0' height='100%' width='100%'>
		<tr background='files/menu.jpg'>
			<td></td>
		</tr>
		</table>
	</div></div>
</body>
</html>
