<?php
// Modified: 06.03.2017
include "../../f_vars0.php";
?>

<title>Інтернет-Ферма. Iнструкцiя. Склад системи</title>
</head>
<?php
include "0_menuuk.php";
?>
			<tr style='background:#f0ffff' height='40'>
				<td colspan='6'>
					<div style='margin-left:7; margin-right:7'><font size='+2'><b>Склад системи</b></font></div>
				</td>
			</tr>
			</table>
		</div></div>
		<div id='content' style='background:#f0ffff; height:60%; overflow-y:auto'><div style='margin-left:7; margin-right:7'>
<p></p>
			<div style='float:left; margin:7'><img border='0' src='files/201_00.jpg'></div>
<b>Загальне поняття:</b><br>
<p>«Интернет-Ферма» - це не просто окреме програмне забезпечення для комп’ютера на фермі. Це цілісний комплекс програмних, електронних та механічних приладів та вузлів, які спеціально налаштовані для синхронної та злагодженої роботи з метою здійснення постійного, автоматичного, ефективного управління вашим господарством. Комплекс працює в автономному режимі та практично не потребує втручання з боку персоналу господарства. Комплекс самостійно виконує збирання, впорядкування та занесення оперативної інформації до бази даних. Комплекс обробляє одержані дані та автоматично формує звіти за заданими користувачем параметрами.</p>
			<div style='float:right; margin:7'><img border='0' src='files/201_01.jpg'></div>
<b>Склад:</b><br>
<ul>
<li>доїльний зал;</li>
<li>система розпізнавання тварин;</li>
<li>селекційні ворота;</li>
<li>процесорний блок;</li>
<li>комп’ютери користувачів;</li>
<li>локальна мережа (можливий доступ до даних через Iнтернет).</li>
</ul>
<b>Доїльний зал («Ялинка»):</b><br>
<p>Доїльний зал типу «Ялинка» забезпечує високий рівень надійності та стабільності, характеризується комфортом для тварин, а також безпекою для оператора машинного доїння. Широка зона входу дозволяє тваринам швидко та безперешкодно входити до доїльного залу. Вхідні ворота закриваються у рівень з останнім доїльним місцем і відповідають за хороше позиціонування всієї групи. Наступні тварини залишаються в активній позиції очікування.</p>
<b>Система розпізнавання тварин:</b><br>
<p>При вході тварини до доїльного залу вона проходить через систему розпізнавання, до складу якої відносяться:</p>
<p><b>1. Зчитувач RFID (рідер)</b> - спеціалізований пристрій, призначений для зчитування інформації з транспондерів, закріплених на тваринах. Насправді він отримує лише ідентифікаційний номер транспондера, завдяки якому програма здатна одержати всі паспортні дані про цю тварину.</p>
<p><b>2. Транспондер</b> - спеціальний електронний пристрій, який закріплюється на тілі тварини (у вусі, на ремінці на шиї або на нозі) для можливості її ідентифікації системою розпізнавання. Кожен транспондер має свій унікальний код, до якого «прив’язується» інформація про тварину в базі даних.</p>
<p><b>3. Фотодатчик</b> - пристрій, який реагує на переривання світлового потоку твариною. Він призначений лише для підрахунку кількості тварин, які пройшли повз нього.</p>
<p><b>4. Блок центрального рідера (БЦР)</b> - пристрій, який формує список тварин, що зайшли до доїльного залу. Цей список він передає до процесорного блока. Для формування черги БЦР користується сигналами зчитувача RFID, фотодатчика та позицією вхідних воріт.</p>
<p>Функції БЦР:</p>
<ul>
<li>аналіз ситуацій, коли тварини можуть рухатися поза встановленими правилами;</li>
<li>управління вхідними воротами;</li>
<li>передача сформованої черги тварин (з кодів їх транспондерів) до процесорного блока.</li>
</ul>
<b>Селекційні ворота:</b><br>
			<div style='float:right; margin:7'><img border='0' src='files/201_02.jpg'></div>
<p>Ворота забезпечують автоматичне відділення тварин одна від одної, яке не потребує безпосереднього контакту персоналу з тваринами. Вони можуть бути використані для розподілу тварин по загонах, для відокремлення по групах за спільними ознаками (віком, надоєм, лактацією, тільністю та т. і.), для виділення окремих особин з метою проведення різних заходів (огляду, запліднення, лікування).</p>
<b>Процесорний блок:</b><br>
<p>Призначений для: зберігання карток тварин; збирання даних про доїння в доїльному залі; управління селекційними воротами; ведення поточних операцій, які відбуваються з кожною твариною; виконання обрахунків з видачею різноманітних електронних документів, які потрібні для управління стадом.</p>
<p>Процесорний блок працює в автоматичному режимі та не вимагає спеціального обслуговування. Користувачі з інших комп’ютерів можуть працювати з даними системи за допомогою звичайних web-браузерів.</p>
<b>Комп’ютери користувачів:</b><br>
<p>Будь-який користувач (зоотехнік, ветеринар, менеджер) має можливість через комп’ютерну мережу або Iнтернет повноцінно працювати з даними системою. Для роботи потрібен лише web-браузер Mozilla Firefox. Відсутні будь-які інші вимоги до комп’ютера, з якого ведеться робота. Потенційно користувач може працювати в системі навіть з комунікатора.</p>
<b>Локальна мережа (можливий доступ до даних через Інтернет):</b><br>
<p>Головним інформаційним каналом «Интернет-Ферма» є інтернет технології, завдяки чому користувач має можливість працювати з будь-якого місця, де є доступ до процерного блока «Интернет-Ферма».</p>
		</div></div>
		<div id='page-clear'></div>
	</div>
	<div id='footer'><div style='margin-left:0; margin-right:0'>
		<table align='center' border='0' cellpadding='0' cellspacing='0' height='100%' width='100%'>
		<tr background='files/menu.jpg'>
			<td></td>
		</tr>
		</table>
	</div></div>
</body>
</html>
