<?php
// Modified: 06.03.2017
include "../../f_vars0.php";
?>

<title>Інтернет-Ферма. Iнструкцiя. Робота програми</title>
</head>
<?php
include "0_menuuk.php";
?>
			<tr style='background:#f0ffff' height='40'>
				<td colspan='6'>
					<div style='margin-left:7; margin-right:7'><font size='+2'><b>Робота програми</b></font></div>
				</td>
			</tr>
			</table>
		</div></div>
		<div id='content' style='background:#f0ffff; height:60%; overflow-y:auto'><div style='margin-left:7; margin-right:7'>
<p></p>
<b>Опис програмного забезпечення:</b><br>
<p>Основною метою роботи «Интернет-Ферма» є автоматизацiя управлiння господарством. Програма надає велику кiлькiсть рiзноманiтних довiдок, звiтiв i графiкiв для одержання оперативної iнформацiї щодо господарства та окремих тварин. Iнформацiя з «Интернет-Ферма» базується на автоматичних обрахунках бiологiчних циклiв тварин, даних, що вносяться оператором комп'ютера, та даних, що надходять в автоматичному режимi з доїльного залу та селекцiйних ворiт.</p>
			<div style='float:right; margin:7'><img border='0' src='files/501_00uk.jpg'></div>
<p>Програма має просте меню, дозволяє одночасно працювати необмеженiй кiлькостi користувачiв по мережi (включно через Iнтернет).</p>
<p>Кожному окремому користувачу призначенi рiзнi права доступу до даних програми. Наприклад, гiсть може лише переглядати данi, а оператор має право вносити новi та змiнювати iснуючi данi.</p>
<b>Перед роботою з програмою необхiдно:</b><br>
<ul>
<li>встановити транспондери на тварин;</li>
<li>зареєструвати транспондери в програмі;</li>
<li>в картках тварин в програмі внести дати народження.</li>
</ul>
<b>Доїння:</b><br>
<p>Найважливіший процес, що виконуються на фермі - це доїння.
Система автоматично отримує детальні дані про кожне доїння, в системі реєструються інтенсивності молоковіддачі протягом трьох перших 30-секундних інтервалів часу. Ці дані дозволяють ефективно оцінювати молочну продуктивність кожної тварини, прогнозувати її надої та своєчасно вживати необхідні заходи.</p>
<b>Відеоспостереження:</b><br>
<p>Система дозволяє вести візуальне спостереження доїльного залу через web-камеру, а також мати докладну інформацію про поточний стан електронного обладнання в залі. Процес роботи можна спостерігати на мнемосхемі доїльного залу.</p>
			<div style='float:right; margin:7'><img border='0' src='files/501_10uk.jpg' width='800px'></div>
<p>Власне мнемосхема - це таблиця з восьми рядків, кожен з яких відображає стан відповідного доїльного апарата, та кнопка для перемикання на наступні доїльні апарати. Зміст кожного рядкав змінюється в наступних випадках:</p>
<ul>
<li>коли тварина ідентифікована системою розпізнавання;</li>
<li>коли доїльний апарат завершив процес доїння та передав результати в програму;</li>
<li>коли доїльний апарат переведений в режим промивки або його вимкнули.</li>
</ul>
<p>В першому випадку у відповідному рядку таблиці мнемосхеми виводяться номер тварини, код транспондера та прізвисько.</p>
<p>В другому – до даних кожної тварини додаються: а) результати вимірів надою; б) тривалість доїння; в) дані, вводяться оператором доїння: мастит, стан "охоти", травма; г) час завершення доїння. Після відображення результатів на мнемосхемі вони фіксуються в базі даних.</p>
<p><i>Примітка: у випадках, коли відбулось доїння незареєстрованої в системі тварини або такої, для якої оператор на доїльному апараті вказав неіснуючий номер, результати доїння також будуть зафіксовані на мнемосхемі та в базі даних. Але тоді вони будуть віднесені до тварини з номером "0".</i></p>
<p>Отримати вищевказані дані можливо не лише про тварин, які знаходяться в залі на даний час. В розділі меню `По залу` надається можливість відтворити детальну інформацію про хід доїння протягом будь-якого періоду. Наприклад, окремо за ранкове, денне або вечірнє доїння.</p>
<b>Детальна інформація про доїння:</b><br>
<p>В розділі меню `По залу` надається детальна інформація про кожне проведене доїння. Тут вказуються:
			<div style='float:right; margin:7'><img border='0' src='files/501_20uk.jpg' width='800px'></div>
<ul>
<li>дата проведення доїння;</li>
<li>номер тварини;</li>
<li>прiзвисько;</li>
<li>код транспондера (RFID);</li>
<li>загальний надiй;</li>
<li>молоковіддача за перші три 30-cекундних інтервали;</li>
<li>час розпізнавання транспондера;</li>
<li>час початку доїння;</li>
<li>час надходження в програму результатів доїння;</li>
<li>тривалість доїння;</li>
<li>пуск з клавіатури блока доїння без використання зчитувача транспондерів;</li>
<li>повторний пуск;</li>
<li>перерване доїння;</li>
<li>низький надій даної тварини;</li>
<li>мастит;</li>
<li>травма;</li>
<li>"охота";</li>
<li>номер блока доїння.</li>
</ul>
</p>
<p>Спеціальні <a href='javascript:{object=window.open("files/501_01uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>фільтри</a> дозволяють користувачу відібрати групу операцій доїння із потрібними ознаками.</p>
<b>Догляд за тваринами:</b><br>
<p>Важливою частиною роботи на фермі є догляд за тваринами. «Интернет-Ферма» дозволяє планувати ті чи інші заходи по догляду за стадом. Також програма обраховує біологічні цикли кожної тварини та надає інформацію (<a href='javascript:{object=window.open("files/501_30uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>розділ меню `Щоденник`</a>) про міроприємства, що потрібно проводити з тваринами станом на поточний день. Наприклад, в ньому відтворюється перелік тварин, яких можна запліднювати. Таким чином, персонал ферми має оперативну інформацію про стан всього стада.</p>
<b>Звіти:</b><br>
<p>В розділі меню `Звіти` розташовані різноманітні звіти по розділах:
<ul>
<li><a href='javascript:{object=window.open("files/501_41uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>Молоко</a>;</li>
<li><a href='javascript:{object=window.open("files/501_42uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>Селекція</a>;</li>
<li><a href='javascript:{object=window.open("files/501_43uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>Загальні;</li>
<li><a href='javascript:{object=window.open("files/501_44uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>Здоров’я</a>;</li>
<li><a href='javascript:{object=window.open("files/501_45uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>Графіки</a>.</li>
</ul>
</p>
<p><a href='javascript:{object=window.open("files/501_01uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>Фільтри</a> можна використовувати і в цьому розділі.</p>
			<div style='float:right; margin:7'><img border='0' src='files/501_40uk.jpg'></div>
<b>Період:</b><br>
<p>Уся звітна інформація, що наявна в базі, виводиться за вказаний користувачем період, тривалість якого регулюється в розділі меню `Період`.</p>
<b>Розділ меню `Картотека`:</b><br>
<p>Кожна тварина має власну електронну <a href='javascript:{object=window.open("files/101_03uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>картку</a>, до якої заноситься паспортна частина, а саме: номер тварини, дата народження, код транспондера, дата реєстрації транспондера, прізвисько, інформація про надої поза доїльним залом, дані про батьків, належність до певної <a href='javascript:{object=window.open("files/501_61uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>ферми</a> (<a href='javascript:{object=window.open("files/501_62uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>секцiї</a>, пiдгрупи, <a href='javascript:{object=window.open("files/501_64uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>породи</a>).</p>
<p>Картотека поділяється на наступні категорії:
<ul>
<li><a href='javascript:{object=window.open("files/501_66uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>картки биків</a>;</li>
<li><a href='javascript:{object=window.open("files/501_65uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>картки корів (телиць)</a>;</li>
<li><a href='javascript:{object=window.open("files/501_61uk.jpg","windowname","menubar=0,location=0,toolbar=0,resizable=0,scrollbars=0");object.focus()}'>картки груп тварин</a>.</li>
</ul>
</p>
<p>Кожна категорія вміщує таблицю зі скороченими даними. Для перегляду детальної інформації по конкретній тварині (корові/телиці, бику) або групі необхідно навести вказівник "миші" на відповідний номер в таблиці та один раз клацнути лівою кнопкою "миші". Відкриється картка, наповненням якої можна керувати спеціальними перемикачами в верхній частині.</p>
<b>Режим використання системи:</b><br>
<p>Комп'ютер, що входить до складу системи «Интернет-Ферма», призначений для цілодобової безперервної роботи. В випадках короткочасного зникнення напруги його робота підтримується блоком безперебійного живлення (ББЖ). В випадках тривалих зникнень напруги, що призводить до автоматичного безпечного вимикання комп’ютера, подальше його завантаження має здiйснювати персонал.</p>
<p><i>УВАГА! Не рекомендується використовувати систему з неробочим ББЖ або взагалі без нього. Цілісність Ваших даних в такому разі не гарантується.</i></p>
<p>З 00:00 до 00:10 за Вашим локальним часом виконуються регламентні роботи з обслуговування бази даних і файлової системи комп’ютера. В цей період часу (технічна перерва) робота персоналу з даними та робота в доїльному залі мають бути призупинені.</p>
		</div></div>
		<div id='page-clear'></div>
	</div>
	<div id='footer'><div style='margin-left:0; margin-right:0'>
		<table align='center' border='0' cellpadding='0' cellspacing='0' height='100%' width='100%'>
		<tr background='files/menu.jpg'>
			<td></td>
		</tr>
		</table>
	</div></div>
</body>
</html>
